tutorials/heatTransfer/buoyantPimpleFoam/hotRoom/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    floor
    {
        type            buoyantPressure;
        value           uniform 1e5;
    }

    ceiling
    {
        type            buoyantPressure;
        value           uniform 1e5;
    }

    fixedWalls
    {
        type            buoyantPressure;
        value           uniform 1e5;
    }
}

// ************************************************************************* //
