tutorials/heatTransfer/buoyantPimpleFoam/hotRoom/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {}
    "p_rgh|p_rghFinal"
    {
        solver          CG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
    "U|UFinal"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
    "h|hFinal"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        minIter         1;
        tolerance       1e-08;
        relTol          0;
    }
    k
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
    epsilon
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors 4;
    nNonOrthogonalCorrectors 0;
    closedVolume yes;
}

relaxationFactors
{
    fields
    {
        p_rgh 1;
    }
    equations
    {
        U 1;
    }
}

// ************************************************************************* //
